In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("C:\\Users\\thora\\cardata.csv")

In [3]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [4]:
X = df.drop("Selling_Price",axis = 1)

In [5]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Present_Price  301 non-null    float64
 3   Kms_Driven     301 non-null    int64
 4   Fuel_Type      301 non-null    object
 5   Seller_Type    301 non-null    object
 6   Transmission   301 non-null    object
 7   Owner          301 non-null    int64
dtypes: float64(1), int64(3), object(4)
memory usage: 18.9+ KB

In [6]:
X.drop(['Car_Name','Present_Price'],axis = 1,inplace = True)

In [7]:
X.isnull().sum()

Year            0
Kms_Driven      0
Fuel_Type       0
Seller_Type     0
Transmission    0
Owner           0
dtype: int64

In [8]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner
0  2014       27000    Petrol      Dealer       Manual      0
1  2013       43000    Diesel      Dealer       Manual      0
2  2017        6900    Petrol      Dealer       Manual      0
3  2011        5200    Petrol      Dealer       Manual      0
4  2014       42450    Diesel      Dealer       Manual      0

In [11]:
X['Years'] = l

In [12]:
type(X['Year'])

pandas.core.series.Series

In [13]:
l = []
for i in X['Year']:
    a = 2023-i
    l.append(a)

In [14]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner  Years
0  2014       27000    Petrol      Dealer       Manual      0      9
1  2013       43000    Diesel      Dealer       Manual      0     10
2  2017        6900    Petrol      Dealer       Manual      0      6
3  2011        5200    Petrol      Dealer       Manual      0     12
4  2014       42450    Diesel      Dealer       Manual      0      9

In [15]:
X.drop("Years",axis = 1,inplace = True)

In [16]:
X['Present_Year']= 2023

In [17]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner  Present_Year
0  2014       27000    Petrol      Dealer       Manual      0          2023
1  2013       43000    Diesel      Dealer       Manual      0          2023
2  2017        6900    Petrol      Dealer       Manual      0          2023
3  2011        5200    Petrol      Dealer       Manual      0          2023
4  2014       42450    Diesel      Dealer       Manual      0          2023

In [18]:
X['Year'] = X['Present_Year'] - X['Year']

In [19]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner  Present_Year
0     9       27000    Petrol      Dealer       Manual      0          2023
1    10       43000    Diesel      Dealer       Manual      0          2023
2     6        6900    Petrol      Dealer       Manual      0          2023
3    12        5200    Petrol      Dealer       Manual      0          2023
4     9       42450    Diesel      Dealer       Manual      0          2023

In [20]:
X.drop("Present_Year",axis = 1,inplace = True)

In [21]:
X.head()

   Year  Kms_Driven Fuel_Type Seller_Type Transmission  Owner
0     9       27000    Petrol      Dealer       Manual      0
1    10       43000    Diesel      Dealer       Manual      0
2     6        6900    Petrol      Dealer       Manual      0
3    12        5200    Petrol      Dealer       Manual      0
4     9       42450    Diesel      Dealer       Manual      0

In [22]:
X.shape

(301, 6)

In [23]:
X['Owner'].unique()

array([0, 1, 3], dtype=int64)

In [24]:
X['Fuel_Type'].unique()

array(['Petrol', 'Diesel', 'CNG'], dtype=object)

In [25]:
X['Transmission'].unique()

array(['Manual', 'Automatic'], dtype=object)

In [26]:
X['Seller_Type'].unique()

array(['Dealer', 'Individual'], dtype=object)

In [27]:
X = pd.get_dummies(data = X,columns = ['Fuel_Type','Seller_Type','Transmission'],drop_first = True)

In [28]:
X.head()

,Year,Kms_Driven,Owner,Fuel_Type_Diesel,Fuel_Type_Petrol,Seller_Type_Individual,Transmission_Manual
0,9,27000,0,0,1,0,1
1,10,43000,0,1,0,0,1
2,6,6900,0,0,1,0,1
3,12,5200,0,0,1,0,1
4,9,42450,0,1,0,0,1

In [29]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Year                    301 non-null    int64
 1   Kms_Driven              301 non-null    int64
 2   Owner                   301 non-null    int64
 3   Fuel_Type_Diesel        301 non-null    uint8
 4   Fuel_Type_Petrol        301 non-null    uint8
 5   Seller_Type_Individual  301 non-null    uint8
 6   Transmission_Manual     301 non-null    uint8
dtypes: int64(3), uint8(4)
memory usage: 8.4 KB

In [30]:
from sklearn.preprocessing import MinMaxScaler

In [31]:
Scaler = MinMaxScaler()

In [32]:
X['Year'] = Scaler.fit_transform(X[['Year']] )

In [33]:
X.head()

,Year,Kms_Driven,Owner,Fuel_Type_Diesel,Fuel_Type_Petrol,Seller_Type_Individual,Transmission_Manual
0,0.266667,27000,0,0,1,0,1
1,0.333333,43000,0,1,0,0,1
2,0.066667,6900,0,0,1,0,1
3,0.466667,5200,0,0,1,0,1
4,0.266667,42450,0,1,0,0,1

In [34]:
X['Kms_Driven'] = Scaler.fit_transform(X[['Kms_Driven']] )
X['Owner'] = Scaler.fit_transform(X[['Owner']] )

In [35]:
X.head()

,Year,Kms_Driven,Owner,Fuel_Type_Diesel,Fuel_Type_Petrol,Seller_Type_Individual,Transmission_Manual
0,0.266667,0.053053,0.0,0,1,0,1
1,0.333333,0.085085,0.0,1,0,0,1
2,0.066667,0.012813,0.0,0,1,0,1
3,0.466667,0.009409,0.0,0,1,0,1
4,0.266667,0.083984,0.0,1,0,0,1

In [ ]:
y

In [38]:
from sklearn.model_selection import train_test_split

In [40]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=42)

NameError: name 'y' is not defined

In [36]:
from sklearn.linear_model import LinearRegression

In [37]:
model = LinearRegression()